Revit 2027 API
ISingleServerService Methods
The ISingleServerService type exposes the following members.
Methods
Name | Description
Execute |  Implement this method to execute the given server.
(Inherited from IExternalService)
GetDescription |  Implement this method to return a description of the service.
(Inherited from IExternalService)
GetName |  Implement this method to return the name of the service.
(Inherited from IExternalService)
GetServiceId |  Implement this method to return the unique Id of the service.
(Inherited from IExternalService)
GetVendorId |  Implement this method to return the vendor Id of the service.
(Inherited from IExternalService)
IsValidServer |  Implement this method to check if the given instance represents a valid server of this service.
(Inherited from IExternalService)
OnServersChanged |  Implement this method to handle situations when servers for the service have changed.
(Inherited from IExternalService)
OnServersDisparity |  Implements this method to get notified that the servers in a just opened document differ from those currently set as active for the service.
(Inherited from IExternalService)
Top
See Also
Reference
ISingleServerService Interface
Autodesk.Revit.DB.ExternalService Namespace